EDT/Config/src/Enums/КачествоРешенияЗадачи/КачествоРешенияЗадачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КачествоРешенияЗадачи</name>
  <enumValues>
    <name>Великолепно</name>
  </enumValues>
  <enumValues>
    <name>Удовлетворительно</name>
  </enumValues>
  <enumValues>
    <name>ТяпЛяп</name>
  </enumValues>
</mdclass:Enum>

EDT/Config/src/Enums/КачествоРешенияЗадачи/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
     	
#Область ПрограммныйИнтерфейс

// Формирует цвет в зависимости от переданного качества решения
//
// Параметры:
//  Качество - ПеречислениеСсылка.КачествоРешенияЗадачи - Качество.
//
// Возвращаемое значение:
//  Цвет - цвет
//
Функция ЦветКачестваРешения(Качество) Экспорт
	
	Если Качество = ПредопределенноеЗначение("Перечисление.КачествоРешенияЗадачи.Великолепно") Тогда
	
		Цвет = Новый Цвет(238, 155, 1); 
		
	ИначеЕсли Качество = ПредопределенноеЗначение("Перечисление.КачествоРешенияЗадачи.Удовлетворительно") Тогда
		
		Цвет = Новый Цвет(104, 144, 77);	

	ИначеЕсли Качество = ПредопределенноеЗначение("Перечисление.КачествоРешенияЗадачи.ТяпЛяп") Тогда
		
		Цвет = Новый Цвет(200, 210, 209);	
		
	Иначе
	
		Цвет = Новый Цвет(211, 212, 216);	
	
	КонецЕсли;
	
	Возврат Цвет;	

КонецФункции 

#КонецОбласти

#КонецЕсли
